GopalSaraf/Practicals/PSDL/include/proc/pic18f06q40.h
extern volatile U1CON0bits_t U1CON0bits __at(0x2AB);
// bitfield macros
#define _U1CON0_MODE0_POSN                                  0x0
#define _U1CON0_MODE0_POSITION                              0x0
#define _U1CON0_MODE0_SIZE                                  0x1
#define _U1CON0_MODE0_LENGTH                                0x1
#define _U1CON0_MODE0_MASK                                  0x1
#define _U1CON0_MODE1_POSN                                  0x1
#define _U1CON0_MODE1_POSITION                              0x1
#define _U1CON0_MODE1_SIZE                                  0x1
#define _U1CON0_MODE1_LENGTH                                0x1
#define _U1CON0_MODE1_MASK                                  0x2
#define _U1CON0_MODE2_POSN                                  0x2
#define _U1CON0_MODE2_POSITION                              0x2
#define _U1CON0_MODE2_SIZE                                  0x1
#define _U1CON0_MODE2_LENGTH                                0x1
#define _U1CON0_MODE2_MASK                                  0x4
#define _U1CON0_MODE3_POSN                                  0x3
#define _U1CON0_MODE3_POSITION                              0x3
#define _U1CON0_MODE3_SIZE                                  0x1
#define _U1CON0_MODE3_LENGTH                                0x1
#define _U1CON0_MODE3_MASK                                  0x8
#define _U1CON0_U1MODE_POSN                                 0x0
#define _U1CON0_U1MODE_POSITION                             0x0
#define _U1CON0_U1MODE_SIZE                                 0x4
#define _U1CON0_U1MODE_LENGTH                               0x4
#define _U1CON0_U1MODE_MASK                                 0xF
#define _U1CON0_U1RXEN_POSN                                 0x4
#define _U1CON0_U1RXEN_POSITION                             0x4
#define _U1CON0_U1RXEN_SIZE                                 0x1
#define _U1CON0_U1RXEN_LENGTH                               0x1
#define _U1CON0_U1RXEN_MASK                                 0x10
#define _U1CON0_U1TXEN_POSN                                 0x5
#define _U1CON0_U1TXEN_POSITION                             0x5
#define _U1CON0_U1TXEN_SIZE                                 0x1
#define _U1CON0_U1TXEN_LENGTH                               0x1
#define _U1CON0_U1TXEN_MASK                                 0x20
#define _U1CON0_U1ABDEN_POSN                                0x6
#define _U1CON0_U1ABDEN_POSITION                            0x6
#define _U1CON0_U1ABDEN_SIZE                                0x1
#define _U1CON0_U1ABDEN_LENGTH                              0x1
#define _U1CON0_U1ABDEN_MASK                                0x40
#define _U1CON0_U1BRGS_POSN                                 0x7
#define _U1CON0_U1BRGS_POSITION                             0x7
#define _U1CON0_U1BRGS_SIZE                                 0x1
#define _U1CON0_U1BRGS_LENGTH                               0x1
#define _U1CON0_U1BRGS_MASK                                 0x80
#define _U1CON0_U1MODE0_POSN                                0x0
#define _U1CON0_U1MODE0_POSITION                            0x0
#define _U1CON0_U1MODE0_SIZE                                0x1
#define _U1CON0_U1MODE0_LENGTH                              0x1
#define _U1CON0_U1MODE0_MASK                                0x1
#define _U1CON0_U1MODE1_POSN                                0x1
#define _U1CON0_U1MODE1_POSITION                            0x1
#define _U1CON0_U1MODE1_SIZE                                0x1
#define _U1CON0_U1MODE1_LENGTH                              0x1
#define _U1CON0_U1MODE1_MASK                                0x2
#define _U1CON0_U1MODE2_POSN                                0x2
#define _U1CON0_U1MODE2_POSITION                            0x2
#define _U1CON0_U1MODE2_SIZE                                0x1
#define _U1CON0_U1MODE2_LENGTH                              0x1
#define _U1CON0_U1MODE2_MASK                                0x4
#define _U1CON0_U1MODE3_POSN                                0x3
#define _U1CON0_U1MODE3_POSITION                            0x3
#define _U1CON0_U1MODE3_SIZE                                0x1
#define _U1CON0_U1MODE3_LENGTH                              0x1
#define _U1CON0_U1MODE3_MASK                                0x8
#define _U1CON0_MODE_POSN                                   0x0
#define _U1CON0_MODE_POSITION                               0x0
#define _U1CON0_MODE_SIZE                                   0x4
#define _U1CON0_MODE_LENGTH                                 0x4
#define _U1CON0_MODE_MASK                                   0xF
#define _U1CON0_RXEN_POSN                                   0x4
#define _U1CON0_RXEN_POSITION                               0x4
#define _U1CON0_RXEN_SIZE                                   0x1
#define _U1CON0_RXEN_LENGTH                                 0x1
#define _U1CON0_RXEN_MASK                                   0x10
#define _U1CON0_TXEN_POSN                                   0x5
#define _U1CON0_TXEN_POSITION                               0x5
#define _U1CON0_TXEN_SIZE                                   0x1
#define _U1CON0_TXEN_LENGTH                                 0x1
#define _U1CON0_TXEN_MASK                                   0x20
#define _U1CON0_ABDEN_POSN                                  0x6
#define _U1CON0_ABDEN_POSITION                              0x6
#define _U1CON0_ABDEN_SIZE                                  0x1
#define _U1CON0_ABDEN_LENGTH                                0x1
#define _U1CON0_ABDEN_MASK                                  0x40
#define _U1CON0_BRGS_POSN                                   0x7
#define _U1CON0_BRGS_POSITION                               0x7
#define _U1CON0_BRGS_SIZE                                   0x1
#define _U1CON0_BRGS_LENGTH                                 0x1
#define _U1CON0_BRGS_MASK                                   0x80

// Register: U1CON1
#define U1CON1 U1CON1
extern volatile unsigned char           U1CON1              __at(0x2AC);
#ifndef _LIB_BUILD
asm("U1CON1 equ 02ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U1SENDB                :1;
        unsigned U1BRKOVR               :1;
        unsigned                        :1;
        unsigned U1RXBIMD               :1;
        unsigned U1WUE                  :1;
        unsigned                        :2;
        unsigned U1ON                   :1;
    };
} U1CON1bits_t;
extern volatile U1CON1bits_t U1CON1bits __at(0x2AC);
// bitfield macros
#define _U1CON1_SENDB_POSN                                  0x0
#define _U1CON1_SENDB_POSITION                              0x0
#define _U1CON1_SENDB_SIZE                                  0x1
#define _U1CON1_SENDB_LENGTH                                0x1
#define _U1CON1_SENDB_MASK                                  0x1
#define _U1CON1_BRKOVR_POSN                                 0x1
#define _U1CON1_BRKOVR_POSITION                             0x1
#define _U1CON1_BRKOVR_SIZE                                 0x1
#define _U1CON1_BRKOVR_LENGTH                               0x1
#define _U1CON1_BRKOVR_MASK                                 0x2
#define _U1CON1_RXBIMD_POSN                                 0x3
#define _U1CON1_RXBIMD_POSITION                             0x3
#define _U1CON1_RXBIMD_SIZE                                 0x1
#define _U1CON1_RXBIMD_LENGTH                               0x1
#define _U1CON1_RXBIMD_MASK                                 0x8
#define _U1CON1_WUE_POSN                                    0x4
#define _U1CON1_WUE_POSITION                                0x4
#define _U1CON1_WUE_SIZE                                    0x1
#define _U1CON1_WUE_LENGTH                                  0x1
#define _U1CON1_WUE_MASK                                    0x10
#define _U1CON1_ON_POSN                                     0x7
#define _U1CON1_ON_POSITION                                 0x7
#define _U1CON1_ON_SIZE                                     0x1
#define _U1CON1_ON_LENGTH                                   0x1
#define _U1CON1_ON_MASK                                     0x80
#define _U1CON1_U1SENDB_POSN                                0x0
#define _U1CON1_U1SENDB_POSITION                            0x0
#define _U1CON1_U1SENDB_SIZE                                0x1
#define _U1CON1_U1SENDB_LENGTH                              0x1
#define _U1CON1_U1SENDB_MASK                                0x1
#define _U1CON1_U1BRKOVR_POSN                               0x1
#define _U1CON1_U1BRKOVR_POSITION                           0x1
#define _U1CON1_U1BRKOVR_SIZE                               0x1
#define _U1CON1_U1BRKOVR_LENGTH                             0x1
#define _U1CON1_U1BRKOVR_MASK                               0x2
#define _U1CON1_U1RXBIMD_POSN                               0x3
#define _U1CON1_U1RXBIMD_POSITION                           0x3
#define _U1CON1_U1RXBIMD_SIZE                               0x1
#define _U1CON1_U1RXBIMD_LENGTH                             0x1
#define _U1CON1_U1RXBIMD_MASK                               0x8
#define _U1CON1_U1WUE_POSN                                  0x4
#define _U1CON1_U1WUE_POSITION                              0x4
#define _U1CON1_U1WUE_SIZE                                  0x1
#define _U1CON1_U1WUE_LENGTH                                0x1
#define _U1CON1_U1WUE_MASK                                  0x10
#define _U1CON1_U1ON_POSN                                   0x7
#define _U1CON1_U1ON_POSITION                               0x7
#define _U1CON1_U1ON_SIZE                                   0x1
#define _U1CON1_U1ON_LENGTH                                 0x1
#define _U1CON1_U1ON_MASK                                   0x80

// Register: U1CON2
#define U1CON2 U1CON2
extern volatile unsigned char           U1CON2              __at(0x2AD);
#ifndef _LIB_BUILD
asm("U1CON2 equ 02ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned C0EN                   :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U1FLO                  :2;
        unsigned U1TXPOL                :1;
        unsigned U1C0EN                 :1;
        unsigned U1STP                  :2;
        unsigned U1RXPOL                :1;
        unsigned U1RUNOVF               :1;
    };
    struct {
        unsigned U1FLO0                 :1;
        unsigned U1FLO1                 :1;
        unsigned                        :2;
        unsigned U1STP0                 :1;
        unsigned U1STP1                 :1;
    };
} U1CON2bits_t;
extern volatile U1CON2bits_t U1CON2bits __at(0x2AD);
// bitfield macros
#define _U1CON2_FLO_POSN                                    0x0
#define _U1CON2_FLO_POSITION                                0x0
#define _U1CON2_FLO_SIZE                                    0x2
#define _U1CON2_FLO_LENGTH                                  0x2
#define _U1CON2_FLO_MASK                                    0x3
#define _U1CON2_TXPOL_POSN                                  0x2
#define _U1CON2_TXPOL_POSITION                              0x2
#define _U1CON2_TXPOL_SIZE                                  0x1
#define _U1CON2_TXPOL_LENGTH                                0x1
#define _U1CON2_TXPOL_MASK                                  0x4
#define _U1CON2_C0EN_POSN                                   0x3
#define _U1CON2_C0EN_POSITION                               0x3
#define _U1CON2_C0EN_SIZE                                   0x1
#define _U1CON2_C0EN_LENGTH                                 0x1
#define _U1CON2_C0EN_MASK                                   0x8
#define _U1CON2_STP_POSN                                    0x4
#define _U1CON2_STP_POSITION                                0x4
#define _U1CON2_STP_SIZE                                    0x2
#define _U1CON2_STP_LENGTH                                  0x2
#define _U1CON2_STP_MASK                                    0x30
#define _U1CON2_RXPOL_POSN                                  0x6
#define _U1CON2_RXPOL_POSITION                              0x6
#define _U1CON2_RXPOL_SIZE                                  0x1
#define _U1CON2_RXPOL_LENGTH                                0x1
#define _U1CON2_RXPOL_MASK                                  0x40
#define _U1CON2_RUNOVF_POSN                                 0x7
#define _U1CON2_RUNOVF_POSITION                             0x7
#define _U1CON2_RUNOVF_SIZE                                 0x1
#define _U1CON2_RUNOVF_LENGTH                               0x1
#define _U1CON2_RUNOVF_MASK                                 0x80
#define _U1CON2_FLO0_POSN                                   0x0
#define _U1CON2_FLO0_POSITION                               0x0
#define _U1CON2_FLO0_SIZE                                   0x1
#define _U1CON2_FLO0_LENGTH                                 0x1
#define _U1CON2_FLO0_MASK                                   0x1
#define _U1CON2_FLO1_POSN                                   0x1
#define _U1CON2_FLO1_POSITION                               0x1
#define _U1CON2_FLO1_SIZE                                   0x1
#define _U1CON2_FLO1_LENGTH                                 0x1
#define _U1CON2_FLO1_MASK                                   0x2
#define _U1CON2_STP0_POSN                                   0x4
#define _U1CON2_STP0_POSITION                               0x4
#define _U1CON2_STP0_SIZE                                   0x1
#define _U1CON2_STP0_LENGTH                                 0x1
#define _U1CON2_STP0_MASK                                   0x10
#define _U1CON2_STP1_POSN                                   0x5
#define _U1CON2_STP1_POSITION                               0x5
#define _U1CON2_STP1_SIZE                                   0x1
#define _U1CON2_STP1_LENGTH                                 0x1
#define _U1CON2_STP1_MASK                                   0x20
#define _U1CON2_U1FLO_POSN                                  0x0
#define _U1CON2_U1FLO_POSITION                              0x0
#define _U1CON2_U1FLO_SIZE                                  0x2
#define _U1CON2_U1FLO_LENGTH                                0x2
#define _U1CON2_U1FLO_MASK                                  0x3
#define _U1CON2_U1TXPOL_POSN                                0x2
#define _U1CON2_U1TXPOL_POSITION                            0x2
#define _U1CON2_U1TXPOL_SIZE                                0x1
#define _U1CON2_U1TXPOL_LENGTH                              0x1
#define _U1CON2_U1TXPOL_MASK                                0x4
#define _U1CON2_U1C0EN_POSN                                 0x3
#define _U1CON2_U1C0EN_POSITION                             0x3
#define _U1CON2_U1C0EN_SIZE                                 0x1
#define _U1CON2_U1C0EN_LENGTH                               0x1
#define _U1CON2_U1C0EN_MASK                                 0x8
#define _U1CON2_U1STP_POSN                                  0x4
#define _U1CON2_U1STP_POSITION                              0x4
#define _U1CON2_U1STP_SIZE                                  0x2
#define _U1CON2_U1STP_LENGTH                                0x2
#define _U1CON2_U1STP_MASK                                  0x30
#define _U1CON2_U1RXPOL_POSN                                0x6
#define _U1CON2_U1RXPOL_POSITION                            0x6
#define _U1CON2_U1RXPOL_SIZE                                0x1
#define _U1CON2_U1RXPOL_LENGTH                              0x1
#define _U1CON2_U1RXPOL_MASK                                0x40
#define _U1CON2_U1RUNOVF_POSN                               0x7
#define _U1CON2_U1RUNOVF_POSITION                           0x7
#define _U1CON2_U1RUNOVF_SIZE                               0x1
#define _U1CON2_U1RUNOVF_LENGTH                             0x1
#define _U1CON2_U1RUNOVF_MASK                               0x80
#define _U1CON2_U1FLO0_POSN                                 0x0
#define _U1CON2_U1FLO0_POSITION                             0x0
#define _U1CON2_U1FLO0_SIZE                                 0x1
#define _U1CON2_U1FLO0_LENGTH                               0x1
#define _U1CON2_U1FLO0_MASK                                 0x1
#define _U1CON2_U1FLO1_POSN                                 0x1
#define _U1CON2_U1FLO1_POSITION                             0x1
#define _U1CON2_U1FLO1_SIZE                                 0x1
#define _U1CON2_U1FLO1_LENGTH                               0x1
#define _U1CON2_U1FLO1_MASK                                 0x2
#define _U1CON2_U1STP0_POSN                                 0x4
#define _U1CON2_U1STP0_POSITION                             0x4
#define _U1CON2_U1STP0_SIZE                                 0x1
#define _U1CON2_U1STP0_LENGTH                               0x1
#define _U1CON2_U1STP0_MASK                                 0x10
#define _U1CON2_U1STP1_POSN                                 0x5
#define _U1CON2_U1STP1_POSITION                             0x5
#define _U1CON2_U1STP1_SIZE                                 0x1
#define _U1CON2_U1STP1_LENGTH                               0x1
#define _U1CON2_U1STP1_MASK                                 0x20

// Register: U1BRG
#define U1BRG U1BRG
extern volatile unsigned short          U1BRG               __at(0x2AE);
#ifndef _LIB_BUILD
asm("U1BRG equ 02AEh");
#endif

// Register: U1BRGL
#define U1BRGL U1BRGL
extern volatile unsigned char           U1BRGL              __at(0x2AE);
#ifndef _LIB_BUILD
asm("U1BRGL equ 02AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U1BRGLbits_t;
extern volatile U1BRGLbits_t U1BRGLbits __at(0x2AE);
// bitfield macros
#define _U1BRGL_BRGL_POSN                                   0x0
#define _U1BRGL_BRGL_POSITION                               0x0
#define _U1BRGL_BRGL_SIZE                                   0x8
#define _U1BRGL_BRGL_LENGTH                                 0x8
#define _U1BRGL_BRGL_MASK                                   0xFF

// Register: U1BRGH
#define U1BRGH U1BRGH
extern volatile unsigned char           U1BRGH              __at(0x2AF);
#ifndef _LIB_BUILD
asm("U1BRGH equ 02AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U1BRGHbits_t;
