GopalSaraf/Practicals/PSDL/include/proc/pic18f06q40.h
extern volatile PIR2bits_t PIR2bits __at(0x4B5);
// bitfield macros
#define _PIR2_ADTIF_POSN                                    0x0
#define _PIR2_ADTIF_POSITION                                0x0
#define _PIR2_ADTIF_SIZE                                    0x1
#define _PIR2_ADTIF_LENGTH                                  0x1
#define _PIR2_ADTIF_MASK                                    0x1
#define _PIR2_DMA1SCNTIF_POSN                               0x4
#define _PIR2_DMA1SCNTIF_POSITION                           0x4
#define _PIR2_DMA1SCNTIF_SIZE                               0x1
#define _PIR2_DMA1SCNTIF_LENGTH                             0x1
#define _PIR2_DMA1SCNTIF_MASK                               0x10
#define _PIR2_DMA1DCNTIF_POSN                               0x5
#define _PIR2_DMA1DCNTIF_POSITION                           0x5
#define _PIR2_DMA1DCNTIF_SIZE                               0x1
#define _PIR2_DMA1DCNTIF_LENGTH                             0x1
#define _PIR2_DMA1DCNTIF_MASK                               0x20
#define _PIR2_DMA1ORIF_POSN                                 0x6
#define _PIR2_DMA1ORIF_POSITION                             0x6
#define _PIR2_DMA1ORIF_SIZE                                 0x1
#define _PIR2_DMA1ORIF_LENGTH                               0x1
#define _PIR2_DMA1ORIF_MASK                                 0x40
#define _PIR2_DMA1AIF_POSN                                  0x7
#define _PIR2_DMA1AIF_POSITION                              0x7
#define _PIR2_DMA1AIF_SIZE                                  0x1
#define _PIR2_DMA1AIF_LENGTH                                0x1
#define _PIR2_DMA1AIF_MASK                                  0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x4B6);
#ifndef _LIB_BUILD
asm("PIR3 equ 04B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
        unsigned CCP1IF                 :1;
        unsigned TMR0IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x4B6);
// bitfield macros
#define _PIR3_SPI1RXIF_POSN                                 0x0
#define _PIR3_SPI1RXIF_POSITION                             0x0
#define _PIR3_SPI1RXIF_SIZE                                 0x1
#define _PIR3_SPI1RXIF_LENGTH                               0x1
#define _PIR3_SPI1RXIF_MASK                                 0x1
#define _PIR3_SPI1TXIF_POSN                                 0x1
#define _PIR3_SPI1TXIF_POSITION                             0x1
#define _PIR3_SPI1TXIF_SIZE                                 0x1
#define _PIR3_SPI1TXIF_LENGTH                               0x1
#define _PIR3_SPI1TXIF_MASK                                 0x2
#define _PIR3_SPI1IF_POSN                                   0x2
#define _PIR3_SPI1IF_POSITION                               0x2
#define _PIR3_SPI1IF_SIZE                                   0x1
#define _PIR3_SPI1IF_LENGTH                                 0x1
#define _PIR3_SPI1IF_MASK                                   0x4
#define _PIR3_TMR2IF_POSN                                   0x3
#define _PIR3_TMR2IF_POSITION                               0x3
#define _PIR3_TMR2IF_SIZE                                   0x1
#define _PIR3_TMR2IF_LENGTH                                 0x1
#define _PIR3_TMR2IF_MASK                                   0x8
#define _PIR3_TMR1IF_POSN                                   0x4
#define _PIR3_TMR1IF_POSITION                               0x4
#define _PIR3_TMR1IF_SIZE                                   0x1
#define _PIR3_TMR1IF_LENGTH                                 0x1
#define _PIR3_TMR1IF_MASK                                   0x10
#define _PIR3_TMR1GIF_POSN                                  0x5
#define _PIR3_TMR1GIF_POSITION                              0x5
#define _PIR3_TMR1GIF_SIZE                                  0x1
#define _PIR3_TMR1GIF_LENGTH                                0x1
#define _PIR3_TMR1GIF_MASK                                  0x20
#define _PIR3_CCP1IF_POSN                                   0x6
#define _PIR3_CCP1IF_POSITION                               0x6
#define _PIR3_CCP1IF_SIZE                                   0x1
#define _PIR3_CCP1IF_LENGTH                                 0x1
#define _PIR3_CCP1IF_MASK                                   0x40
#define _PIR3_TMR0IF_POSN                                   0x7
#define _PIR3_TMR0IF_POSITION                               0x7
#define _PIR3_TMR0IF_SIZE                                   0x1
#define _PIR3_TMR0IF_LENGTH                                 0x1
#define _PIR3_TMR0IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x4B7);
#ifndef _LIB_BUILD
asm("PIR4 equ 04B7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1EIF                  :1;
        unsigned U1IF                   :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
        unsigned PWM1PIF                :1;
        unsigned PWM1IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x4B7);
// bitfield macros
#define _PIR4_U1RXIF_POSN                                   0x0
#define _PIR4_U1RXIF_POSITION                               0x0
#define _PIR4_U1RXIF_SIZE                                   0x1
#define _PIR4_U1RXIF_LENGTH                                 0x1
#define _PIR4_U1RXIF_MASK                                   0x1
#define _PIR4_U1TXIF_POSN                                   0x1
#define _PIR4_U1TXIF_POSITION                               0x1
#define _PIR4_U1TXIF_SIZE                                   0x1
#define _PIR4_U1TXIF_LENGTH                                 0x1
#define _PIR4_U1TXIF_MASK                                   0x2
#define _PIR4_U1EIF_POSN                                    0x2
#define _PIR4_U1EIF_POSITION                                0x2
#define _PIR4_U1EIF_SIZE                                    0x1
#define _PIR4_U1EIF_LENGTH                                  0x1
#define _PIR4_U1EIF_MASK                                    0x4
#define _PIR4_U1IF_POSN                                     0x3
#define _PIR4_U1IF_POSITION                                 0x3
#define _PIR4_U1IF_SIZE                                     0x1
#define _PIR4_U1IF_LENGTH                                   0x1
#define _PIR4_U1IF_MASK                                     0x8
#define _PIR4_TMR3IF_POSN                                   0x4
#define _PIR4_TMR3IF_POSITION                               0x4
#define _PIR4_TMR3IF_SIZE                                   0x1
#define _PIR4_TMR3IF_LENGTH                                 0x1
#define _PIR4_TMR3IF_MASK                                   0x10
#define _PIR4_TMR3GIF_POSN                                  0x5
#define _PIR4_TMR3GIF_POSITION                              0x5
#define _PIR4_TMR3GIF_SIZE                                  0x1
#define _PIR4_TMR3GIF_LENGTH                                0x1
#define _PIR4_TMR3GIF_MASK                                  0x20
#define _PIR4_PWM1PIF_POSN                                  0x6
#define _PIR4_PWM1PIF_POSITION                              0x6
#define _PIR4_PWM1PIF_SIZE                                  0x1
#define _PIR4_PWM1PIF_LENGTH                                0x1
#define _PIR4_PWM1PIF_MASK                                  0x40
#define _PIR4_PWM1IF_POSN                                   0x7
#define _PIR4_PWM1IF_POSITION                               0x7
#define _PIR4_PWM1IF_SIZE                                   0x1
#define _PIR4_PWM1IF_LENGTH                                 0x1
#define _PIR4_PWM1IF_MASK                                   0x80

