GopalSaraf/Practicals/PSDL/include/proc/pic18f06q40.h
extern volatile __bit                   SPI2CLKSEL3         __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 SPI2CLKSEL3_bit     _BIT_ACCESS(SPI2CLK,3)
// SPI2STATUS<SPI2CLRBF>
extern volatile __bit                   SPI2CLRBF           __at(0x4A2);	// @ (0x94 * 8 + 2)
#define                                 SPI2CLRBF_bit       _BIT_ACCESS(SPI2STATUS,2)
// SPI2INTE<SPI2EOSIE>
extern volatile __bit                   SPI2EOSIE           __at(0x4C4);	// @ (0x98 * 8 + 4)
#define                                 SPI2EOSIE_bit       _BIT_ACCESS(SPI2INTE,4)
// SPI2INTF<SPI2EOSIF>
extern volatile __bit                   SPI2EOSIF           __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 SPI2EOSIF_bit       _BIT_ACCESS(SPI2INTF,4)
// SPI2CON1<SPI2FST>
extern volatile __bit                   SPI2FST             __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 SPI2FST_bit         _BIT_ACCESS(SPI2CON1,4)
// PIE5<SPI2IE>
extern volatile __bit                   SPI2IE              __at(0x256A);	// @ (0x4AD * 8 + 2)
#define                                 SPI2IE_bit          _BIT_ACCESS(PIE5,2)
// PIR5<SPI2IF>
extern volatile __bit                   SPI2IF              __at(0x25C2);	// @ (0x4B8 * 8 + 2)
#define                                 SPI2IF_bit          _BIT_ACCESS(PIR5,2)
// IPR5<SPI2IP>
extern volatile __bit                   SPI2IP              __at(0x1B62);	// @ (0x36C * 8 + 2)
#define                                 SPI2IP_bit          _BIT_ACCESS(IPR5,2)
// SPI2CON0<SPI2LSBF>
extern volatile __bit                   SPI2LSBF            __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 SPI2LSBF_bit        _BIT_ACCESS(SPI2CON0,2)
// PMD3<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD3,5)
// SPI2CON0<SPI2MST>
extern volatile __bit                   SPI2MST             __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 SPI2MST_bit         _BIT_ACCESS(SPI2CON0,1)
// SPI2STATUS<SPI2RXBF>
extern volatile __bit                   SPI2RXBF            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 SPI2RXBF_bit        _BIT_ACCESS(SPI2STATUS,0)
// PIE5<SPI2RXIE>
extern volatile __bit                   SPI2RXIE            __at(0x2568);	// @ (0x4AD * 8 + 0)
#define                                 SPI2RXIE_bit        _BIT_ACCESS(PIE5,0)
// PIR5<SPI2RXIF>
extern volatile __bit                   SPI2RXIF            __at(0x25C0);	// @ (0x4B8 * 8 + 0)
#define                                 SPI2RXIF_bit        _BIT_ACCESS(PIR5,0)
// IPR5<SPI2RXIP>
extern volatile __bit                   SPI2RXIP            __at(0x1B60);	// @ (0x36C * 8 + 0)
#define                                 SPI2RXIP_bit        _BIT_ACCESS(IPR5,0)
// SPI2INTE<SPI2RXOIE>
extern volatile __bit                   SPI2RXOIE           __at(0x4C2);	// @ (0x98 * 8 + 2)
#define                                 SPI2RXOIE_bit       _BIT_ACCESS(SPI2INTE,2)
// SPI2INTF<SPI2RXOIF>
extern volatile __bit                   SPI2RXOIF           __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 SPI2RXOIF_bit       _BIT_ACCESS(SPI2INTF,2)
// SPI2CON2<SPI2RXR>
extern volatile __bit                   SPI2RXR             __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 SPI2RXR_bit         _BIT_ACCESS(SPI2CON2,0)
// SPI2STATUS<SPI2RXRE>
extern volatile __bit                   SPI2RXRE            __at(0x4A3);	// @ (0x94 * 8 + 3)
#define                                 SPI2RXRE_bit        _BIT_ACCESS(SPI2STATUS,3)
// SPI2SCKPPS<SPI2SCKPPS0>
extern volatile __bit                   SPI2SCKPPS0         __at(0x1368);	// @ (0x26D * 8 + 0)
#define                                 SPI2SCKPPS0_bit     _BIT_ACCESS(SPI2SCKPPS,0)
// SPI2SCKPPS<SPI2SCKPPS1>
extern volatile __bit                   SPI2SCKPPS1         __at(0x1369);	// @ (0x26D * 8 + 1)
#define                                 SPI2SCKPPS1_bit     _BIT_ACCESS(SPI2SCKPPS,1)
// SPI2SCKPPS<SPI2SCKPPS2>
extern volatile __bit                   SPI2SCKPPS2         __at(0x136A);	// @ (0x26D * 8 + 2)
#define                                 SPI2SCKPPS2_bit     _BIT_ACCESS(SPI2SCKPPS,2)
// SPI2SCKPPS<SPI2SCKPPS3>
extern volatile __bit                   SPI2SCKPPS3         __at(0x136B);	// @ (0x26D * 8 + 3)
#define                                 SPI2SCKPPS3_bit     _BIT_ACCESS(SPI2SCKPPS,3)
// SPI2SCKPPS<SPI2SCKPPS4>
extern volatile __bit                   SPI2SCKPPS4         __at(0x136C);	// @ (0x26D * 8 + 4)
#define                                 SPI2SCKPPS4_bit     _BIT_ACCESS(SPI2SCKPPS,4)
// SPI2SCKPPS<SPI2SCKPPS5>
extern volatile __bit                   SPI2SCKPPS5         __at(0x136D);	// @ (0x26D * 8 + 5)
#define                                 SPI2SCKPPS5_bit     _BIT_ACCESS(SPI2SCKPPS,5)
// SPI2CON1<SPI2SDIP>
extern volatile __bit                   SPI2SDIP            __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 SPI2SDIP_bit        _BIT_ACCESS(SPI2CON1,1)
// SPI2SDIPPS<SPI2SDIPPS0>
extern volatile __bit                   SPI2SDIPPS0         __at(0x1370);	// @ (0x26E * 8 + 0)
#define                                 SPI2SDIPPS0_bit     _BIT_ACCESS(SPI2SDIPPS,0)
// SPI2SDIPPS<SPI2SDIPPS1>
extern volatile __bit                   SPI2SDIPPS1         __at(0x1371);	// @ (0x26E * 8 + 1)
#define                                 SPI2SDIPPS1_bit     _BIT_ACCESS(SPI2SDIPPS,1)
// SPI2SDIPPS<SPI2SDIPPS2>
extern volatile __bit                   SPI2SDIPPS2         __at(0x1372);	// @ (0x26E * 8 + 2)
#define                                 SPI2SDIPPS2_bit     _BIT_ACCESS(SPI2SDIPPS,2)
// SPI2SDIPPS<SPI2SDIPPS3>
extern volatile __bit                   SPI2SDIPPS3         __at(0x1373);	// @ (0x26E * 8 + 3)
#define                                 SPI2SDIPPS3_bit     _BIT_ACCESS(SPI2SDIPPS,3)
// SPI2SDIPPS<SPI2SDIPPS4>
extern volatile __bit                   SPI2SDIPPS4         __at(0x1374);	// @ (0x26E * 8 + 4)
#define                                 SPI2SDIPPS4_bit     _BIT_ACCESS(SPI2SDIPPS,4)
// SPI2SDIPPS<SPI2SDIPPS5>
extern volatile __bit                   SPI2SDIPPS5         __at(0x1375);	// @ (0x26E * 8 + 5)
#define                                 SPI2SDIPPS5_bit     _BIT_ACCESS(SPI2SDIPPS,5)
// SPI2CON1<SPI2SDOP>
extern volatile __bit                   SPI2SDOP            __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 SPI2SDOP_bit        _BIT_ACCESS(SPI2CON1,0)
// SPI2CON1<SPI2SMP>
extern volatile __bit                   SPI2SMP             __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 SPI2SMP_bit         _BIT_ACCESS(SPI2CON1,7)
// SPI2INTE<SPI2SOSIE>
extern volatile __bit                   SPI2SOSIE           __at(0x4C5);	// @ (0x98 * 8 + 5)
#define                                 SPI2SOSIE_bit       _BIT_ACCESS(SPI2INTE,5)
// SPI2INTF<SPI2SOSIF>
extern volatile __bit                   SPI2SOSIF           __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 SPI2SOSIF_bit       _BIT_ACCESS(SPI2INTF,5)
// SPI2CON0<SPI2SPIEN>
extern volatile __bit                   SPI2SPIEN           __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 SPI2SPIEN_bit       _BIT_ACCESS(SPI2CON0,7)
// SPI2INTE<SPI2SRMTIE>
extern volatile __bit                   SPI2SRMTIE          __at(0x4C7);	// @ (0x98 * 8 + 7)
#define                                 SPI2SRMTIE_bit      _BIT_ACCESS(SPI2INTE,7)
// SPI2INTF<SPI2SRMTIF>
extern volatile __bit                   SPI2SRMTIF          __at(0x4BF);	// @ (0x97 * 8 + 7)
#define                                 SPI2SRMTIF_bit      _BIT_ACCESS(SPI2INTF,7)
// SPI2CON2<SPI2SSET>
extern volatile __bit                   SPI2SSET            __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 SPI2SSET_bit        _BIT_ACCESS(SPI2CON2,2)
// SPI2CON2<SPI2SSFLT>
extern volatile __bit                   SPI2SSFLT           __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 SPI2SSFLT_bit       _BIT_ACCESS(SPI2CON2,6)
// SPI2CON1<SPI2SSP>
extern volatile __bit                   SPI2SSP             __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 SPI2SSP_bit         _BIT_ACCESS(SPI2CON1,2)
// SPI2SSPPS<SPI2SSPPS0>
extern volatile __bit                   SPI2SSPPS0          __at(0x1378);	// @ (0x26F * 8 + 0)
#define                                 SPI2SSPPS0_bit      _BIT_ACCESS(SPI2SSPPS,0)
// SPI2SSPPS<SPI2SSPPS1>
extern volatile __bit                   SPI2SSPPS1          __at(0x1379);	// @ (0x26F * 8 + 1)
#define                                 SPI2SSPPS1_bit      _BIT_ACCESS(SPI2SSPPS,1)
// SPI2SSPPS<SPI2SSPPS2>
extern volatile __bit                   SPI2SSPPS2          __at(0x137A);	// @ (0x26F * 8 + 2)
#define                                 SPI2SSPPS2_bit      _BIT_ACCESS(SPI2SSPPS,2)
// SPI2SSPPS<SPI2SSPPS3>
extern volatile __bit                   SPI2SSPPS3          __at(0x137B);	// @ (0x26F * 8 + 3)
#define                                 SPI2SSPPS3_bit      _BIT_ACCESS(SPI2SSPPS,3)
// SPI2SSPPS<SPI2SSPPS4>
extern volatile __bit                   SPI2SSPPS4          __at(0x137C);	// @ (0x26F * 8 + 4)
#define                                 SPI2SSPPS4_bit      _BIT_ACCESS(SPI2SSPPS,4)
// SPI2SSPPS<SPI2SSPPS5>
extern volatile __bit                   SPI2SSPPS5          __at(0x137D);	// @ (0x26F * 8 + 5)
#define                                 SPI2SSPPS5_bit      _BIT_ACCESS(SPI2SSPPS,5)
// SPI2INTE<SPI2TCZIE>
extern volatile __bit                   SPI2TCZIE           __at(0x4C6);	// @ (0x98 * 8 + 6)
#define                                 SPI2TCZIE_bit       _BIT_ACCESS(SPI2INTE,6)
// SPI2INTF<SPI2TCZIF>
extern volatile __bit                   SPI2TCZIF           __at(0x4BE);	// @ (0x97 * 8 + 6)
#define                                 SPI2TCZIF_bit       _BIT_ACCESS(SPI2INTF,6)
// SPI2STATUS<SPI2TXBE>
extern volatile __bit                   SPI2TXBE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 SPI2TXBE_bit        _BIT_ACCESS(SPI2STATUS,5)
// PIE5<SPI2TXIE>
extern volatile __bit                   SPI2TXIE            __at(0x2569);	// @ (0x4AD * 8 + 1)
#define                                 SPI2TXIE_bit        _BIT_ACCESS(PIE5,1)
// PIR5<SPI2TXIF>
extern volatile __bit                   SPI2TXIF            __at(0x25C1);	// @ (0x4B8 * 8 + 1)
#define                                 SPI2TXIF_bit        _BIT_ACCESS(PIR5,1)
// IPR5<SPI2TXIP>
extern volatile __bit                   SPI2TXIP            __at(0x1B61);	// @ (0x36C * 8 + 1)
#define                                 SPI2TXIP_bit        _BIT_ACCESS(IPR5,1)
// SPI2CON2<SPI2TXR>
extern volatile __bit                   SPI2TXR             __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 SPI2TXR_bit         _BIT_ACCESS(SPI2CON2,1)
// SPI2INTE<SPI2TXUIE>
extern volatile __bit                   SPI2TXUIE           __at(0x4C1);	// @ (0x98 * 8 + 1)
#define                                 SPI2TXUIE_bit       _BIT_ACCESS(SPI2INTE,1)
// SPI2INTF<SPI2TXUIF>
extern volatile __bit                   SPI2TXUIF           __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 SPI2TXUIF_bit       _BIT_ACCESS(SPI2INTF,1)
// SPI2STATUS<SPI2TXWE>
extern volatile __bit                   SPI2TXWE            __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 SPI2TXWE_bit        _BIT_ACCESS(SPI2STATUS,7)
// SMT1CON0<SPOL>
extern volatile __bit                   SPOL                __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SPOL_bit            _BIT_ACCESS(SMT1CON0,3)
// DMAnSPTRL<SPTR0>
extern volatile __bit                   SPTR0               __at(0x7A0);	// @ (0xF4 * 8 + 0)
#define                                 SPTR0_bit           _BIT_ACCESS(DMAnSPTRL,0)
// DMAnSPTRL<SPTR1>
extern volatile __bit                   SPTR1               __at(0x7A1);	// @ (0xF4 * 8 + 1)
#define                                 SPTR1_bit           _BIT_ACCESS(DMAnSPTRL,1)
// DMAnSPTRH<SPTR10>
extern volatile __bit                   SPTR10              __at(0x7AA);	// @ (0xF5 * 8 + 2)
#define                                 SPTR10_bit          _BIT_ACCESS(DMAnSPTRH,2)
// DMAnSPTRH<SPTR11>
extern volatile __bit                   SPTR11              __at(0x7AB);	// @ (0xF5 * 8 + 3)
#define                                 SPTR11_bit          _BIT_ACCESS(DMAnSPTRH,3)
// DMAnSPTRH<SPTR12>
extern volatile __bit                   SPTR12              __at(0x7AC);	// @ (0xF5 * 8 + 4)
#define                                 SPTR12_bit          _BIT_ACCESS(DMAnSPTRH,4)
// DMAnSPTRH<SPTR13>
extern volatile __bit                   SPTR13              __at(0x7AD);	// @ (0xF5 * 8 + 5)
#define                                 SPTR13_bit          _BIT_ACCESS(DMAnSPTRH,5)
// DMAnSPTRH<SPTR14>
extern volatile __bit                   SPTR14              __at(0x7AE);	// @ (0xF5 * 8 + 6)
#define                                 SPTR14_bit          _BIT_ACCESS(DMAnSPTRH,6)
// DMAnSPTRH<SPTR15>
extern volatile __bit                   SPTR15              __at(0x7AF);	// @ (0xF5 * 8 + 7)
#define                                 SPTR15_bit          _BIT_ACCESS(DMAnSPTRH,7)
// DMAnSPTRU<SPTR16>
extern volatile __bit                   SPTR16              __at(0x7B0);	// @ (0xF6 * 8 + 0)
#define                                 SPTR16_bit          _BIT_ACCESS(DMAnSPTRU,0)
// DMAnSPTRU<SPTR17>
extern volatile __bit                   SPTR17              __at(0x7B1);	// @ (0xF6 * 8 + 1)
#define                                 SPTR17_bit          _BIT_ACCESS(DMAnSPTRU,1)
// DMAnSPTRU<SPTR18>
extern volatile __bit                   SPTR18              __at(0x7B2);	// @ (0xF6 * 8 + 2)
#define                                 SPTR18_bit          _BIT_ACCESS(DMAnSPTRU,2)
// DMAnSPTRU<SPTR19>
extern volatile __bit                   SPTR19              __at(0x7B3);	// @ (0xF6 * 8 + 3)
#define                                 SPTR19_bit          _BIT_ACCESS(DMAnSPTRU,3)
// DMAnSPTRL<SPTR2>
extern volatile __bit                   SPTR2               __at(0x7A2);	// @ (0xF4 * 8 + 2)
#define                                 SPTR2_bit           _BIT_ACCESS(DMAnSPTRL,2)
// DMAnSPTRU<SPTR20>
extern volatile __bit                   SPTR20              __at(0x7B4);	// @ (0xF6 * 8 + 4)
#define                                 SPTR20_bit          _BIT_ACCESS(DMAnSPTRU,4)
// DMAnSPTRU<SPTR21>
extern volatile __bit                   SPTR21              __at(0x7B5);	// @ (0xF6 * 8 + 5)
#define                                 SPTR21_bit          _BIT_ACCESS(DMAnSPTRU,5)
// DMAnSPTRL<SPTR3>
extern volatile __bit                   SPTR3               __at(0x7A3);	// @ (0xF4 * 8 + 3)
#define                                 SPTR3_bit           _BIT_ACCESS(DMAnSPTRL,3)
// DMAnSPTRL<SPTR4>
extern volatile __bit                   SPTR4               __at(0x7A4);	// @ (0xF4 * 8 + 4)
#define                                 SPTR4_bit           _BIT_ACCESS(DMAnSPTRL,4)
// DMAnSPTRL<SPTR5>
extern volatile __bit                   SPTR5               __at(0x7A5);	// @ (0xF4 * 8 + 5)
#define                                 SPTR5_bit           _BIT_ACCESS(DMAnSPTRL,5)
// DMAnSPTRL<SPTR6>
extern volatile __bit                   SPTR6               __at(0x7A6);	// @ (0xF4 * 8 + 6)
#define                                 SPTR6_bit           _BIT_ACCESS(DMAnSPTRL,6)
// DMAnSPTRL<SPTR7>
extern volatile __bit                   SPTR7               __at(0x7A7);	// @ (0xF4 * 8 + 7)
#define                                 SPTR7_bit           _BIT_ACCESS(DMAnSPTRL,7)
// DMAnSPTRH<SPTR8>
extern volatile __bit                   SPTR8               __at(0x7A8);	// @ (0xF5 * 8 + 0)
#define                                 SPTR8_bit           _BIT_ACCESS(DMAnSPTRH,0)
// DMAnSPTRH<SPTR9>
extern volatile __bit                   SPTR9               __at(0x7A9);	// @ (0xF5 * 8 + 1)
#define                                 SPTR9_bit           _BIT_ACCESS(DMAnSPTRH,1)
// DMAnSSAL<SSA0>
extern volatile __bit                   SSA0                __at(0x7C8);	// @ (0xF9 * 8 + 0)
#define                                 SSA0_bit            _BIT_ACCESS(DMAnSSAL,0)
// DMAnSSAL<SSA1>
extern volatile __bit                   SSA1                __at(0x7C9);	// @ (0xF9 * 8 + 1)
#define                                 SSA1_bit            _BIT_ACCESS(DMAnSSAL,1)
// DMAnSSAH<SSA10>
extern volatile __bit                   SSA10               __at(0x7D2);	// @ (0xFA * 8 + 2)
#define                                 SSA10_bit           _BIT_ACCESS(DMAnSSAH,2)
// DMAnSSAH<SSA11>
extern volatile __bit                   SSA11               __at(0x7D3);	// @ (0xFA * 8 + 3)
#define                                 SSA11_bit           _BIT_ACCESS(DMAnSSAH,3)
// DMAnSSAH<SSA12>
extern volatile __bit                   SSA12               __at(0x7D4);	// @ (0xFA * 8 + 4)
#define                                 SSA12_bit           _BIT_ACCESS(DMAnSSAH,4)
// DMAnSSAH<SSA13>
extern volatile __bit                   SSA13               __at(0x7D5);	// @ (0xFA * 8 + 5)
#define                                 SSA13_bit           _BIT_ACCESS(DMAnSSAH,5)
// DMAnSSAH<SSA14>
extern volatile __bit                   SSA14               __at(0x7D6);	// @ (0xFA * 8 + 6)
#define                                 SSA14_bit           _BIT_ACCESS(DMAnSSAH,6)
// DMAnSSAH<SSA15>
extern volatile __bit                   SSA15               __at(0x7D7);	// @ (0xFA * 8 + 7)
#define                                 SSA15_bit           _BIT_ACCESS(DMAnSSAH,7)
// DMAnSSAU<SSA16>
extern volatile __bit                   SSA16               __at(0x7D8);	// @ (0xFB * 8 + 0)
#define                                 SSA16_bit           _BIT_ACCESS(DMAnSSAU,0)
// DMAnSSAU<SSA17>
extern volatile __bit                   SSA17               __at(0x7D9);	// @ (0xFB * 8 + 1)
#define                                 SSA17_bit           _BIT_ACCESS(DMAnSSAU,1)
// DMAnSSAU<SSA18>
extern volatile __bit                   SSA18               __at(0x7DA);	// @ (0xFB * 8 + 2)
#define                                 SSA18_bit           _BIT_ACCESS(DMAnSSAU,2)
// DMAnSSAU<SSA19>
extern volatile __bit                   SSA19               __at(0x7DB);	// @ (0xFB * 8 + 3)
#define                                 SSA19_bit           _BIT_ACCESS(DMAnSSAU,3)
// DMAnSSAL<SSA2>
extern volatile __bit                   SSA2                __at(0x7CA);	// @ (0xF9 * 8 + 2)
#define                                 SSA2_bit            _BIT_ACCESS(DMAnSSAL,2)
// DMAnSSAU<SSA20>
extern volatile __bit                   SSA20               __at(0x7DC);	// @ (0xFB * 8 + 4)
#define                                 SSA20_bit           _BIT_ACCESS(DMAnSSAU,4)
// DMAnSSAU<SSA21>
extern volatile __bit                   SSA21               __at(0x7DD);	// @ (0xFB * 8 + 5)
#define                                 SSA21_bit           _BIT_ACCESS(DMAnSSAU,5)
// DMAnSSAL<SSA3>
extern volatile __bit                   SSA3                __at(0x7CB);	// @ (0xF9 * 8 + 3)
#define                                 SSA3_bit            _BIT_ACCESS(DMAnSSAL,3)
// DMAnSSAL<SSA4>
extern volatile __bit                   SSA4                __at(0x7CC);	// @ (0xF9 * 8 + 4)
#define                                 SSA4_bit            _BIT_ACCESS(DMAnSSAL,4)
// DMAnSSAL<SSA5>
extern volatile __bit                   SSA5                __at(0x7CD);	// @ (0xF9 * 8 + 5)
#define                                 SSA5_bit            _BIT_ACCESS(DMAnSSAL,5)
// DMAnSSAL<SSA6>
extern volatile __bit                   SSA6                __at(0x7CE);	// @ (0xF9 * 8 + 6)
#define                                 SSA6_bit            _BIT_ACCESS(DMAnSSAL,6)
// DMAnSSAL<SSA7>
extern volatile __bit                   SSA7                __at(0x7CF);	// @ (0xF9 * 8 + 7)
#define                                 SSA7_bit            _BIT_ACCESS(DMAnSSAL,7)
// DMAnSSAH<SSA8>
extern volatile __bit                   SSA8                __at(0x7D0);	// @ (0xFA * 8 + 0)
#define                                 SSA8_bit            _BIT_ACCESS(DMAnSSAH,0)
// DMAnSSAH<SSA9>
extern volatile __bit                   SSA9                __at(0x7D1);	// @ (0xFA * 8 + 1)
#define                                 SSA9_bit            _BIT_ACCESS(DMAnSSAH,1)
// SMT1SIG<SSEL0>
extern volatile __bit                   SSEL0               __at(0x1880);	// @ (0x310 * 8 + 0)
#define                                 SSEL0_bit           _BIT_ACCESS(SMT1SIG,0)
// SMT1SIG<SSEL1>
extern volatile __bit                   SSEL1               __at(0x1881);	// @ (0x310 * 8 + 1)
#define                                 SSEL1_bit           _BIT_ACCESS(SMT1SIG,1)
// SMT1SIG<SSEL2>
extern volatile __bit                   SSEL2               __at(0x1882);	// @ (0x310 * 8 + 2)
#define                                 SSEL2_bit           _BIT_ACCESS(SMT1SIG,2)
// SMT1SIG<SSEL3>
extern volatile __bit                   SSEL3               __at(0x1883);	// @ (0x310 * 8 + 3)
#define                                 SSEL3_bit           _BIT_ACCESS(SMT1SIG,3)
// SMT1SIG<SSEL4>
extern volatile __bit                   SSEL4               __at(0x1884);	// @ (0x310 * 8 + 4)
#define                                 SSEL4_bit           _BIT_ACCESS(SMT1SIG,4)
// DMAnCON1<SSTP>
extern volatile __bit                   SSTP                __at(0x7E8);	// @ (0xFD * 8 + 0)
#define                                 SSTP_bit            _BIT_ACCESS(DMAnCON1,0)
// DMAnSSZL<SSZ0>
extern volatile __bit                   SSZ0                __at(0x7B8);	// @ (0xF7 * 8 + 0)
#define                                 SSZ0_bit            _BIT_ACCESS(DMAnSSZL,0)
// DMAnSSZL<SSZ1>
extern volatile __bit                   SSZ1                __at(0x7B9);	// @ (0xF7 * 8 + 1)
#define                                 SSZ1_bit            _BIT_ACCESS(DMAnSSZL,1)
// DMAnSSZH<SSZ10>
extern volatile __bit                   SSZ10               __at(0x7C2);	// @ (0xF8 * 8 + 2)
#define                                 SSZ10_bit           _BIT_ACCESS(DMAnSSZH,2)
// DMAnSSZH<SSZ11>
extern volatile __bit                   SSZ11               __at(0x7C3);	// @ (0xF8 * 8 + 3)
#define                                 SSZ11_bit           _BIT_ACCESS(DMAnSSZH,3)
// DMAnSSZL<SSZ2>
extern volatile __bit                   SSZ2                __at(0x7BA);	// @ (0xF7 * 8 + 2)
#define                                 SSZ2_bit            _BIT_ACCESS(DMAnSSZL,2)
// DMAnSSZL<SSZ3>
extern volatile __bit                   SSZ3                __at(0x7BB);	// @ (0xF7 * 8 + 3)
#define                                 SSZ3_bit            _BIT_ACCESS(DMAnSSZL,3)
// DMAnSSZL<SSZ4>
extern volatile __bit                   SSZ4                __at(0x7BC);	// @ (0xF7 * 8 + 4)
#define                                 SSZ4_bit            _BIT_ACCESS(DMAnSSZL,4)
// DMAnSSZL<SSZ5>
extern volatile __bit                   SSZ5                __at(0x7BD);	// @ (0xF7 * 8 + 5)
#define                                 SSZ5_bit            _BIT_ACCESS(DMAnSSZL,5)
// DMAnSSZL<SSZ6>
extern volatile __bit                   SSZ6                __at(0x7BE);	// @ (0xF7 * 8 + 6)
#define                                 SSZ6_bit            _BIT_ACCESS(DMAnSSZL,6)
// DMAnSSZL<SSZ7>
extern volatile __bit                   SSZ7                __at(0x7BF);	// @ (0xF7 * 8 + 7)
#define                                 SSZ7_bit            _BIT_ACCESS(DMAnSSZL,7)
// DMAnSSZH<SSZ8>
extern volatile __bit                   SSZ8                __at(0x7C0);	// @ (0xF8 * 8 + 0)
#define                                 SSZ8_bit            _BIT_ACCESS(DMAnSSZH,0)
// DMAnSSZH<SSZ9>
extern volatile __bit                   SSZ9                __at(0x7C1);	// @ (0xF8 * 8 + 1)
