GopalSaraf/Practicals/PSDL/include/proc/pic18f06q40.h
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x1924);	// @ (0x324 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x1925);	// @ (0x324 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1926);	// @ (0x324 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE4<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x2564);	// @ (0x4AC * 8 + 4)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x25BC);	// @ (0x4B7 * 8 + 4)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x1B5C);	// @ (0x36B * 8 + 4)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR4,4)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1918);	// @ (0x323 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1919);	// @ (0x323 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x191A);	// @ (0x323 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x191B);	// @ (0x323 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x191C);	// @ (0x323 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x323);	// @ (0x64 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1928);	// @ (0x325 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE10<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x2593);	// @ (0x4B2 * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE10,3)
// PIR10<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x25EB);	// @ (0x4BD * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR10,3)
// IPR10<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x1B8B);	// @ (0x371 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR10,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x324);	// @ (0x64 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x195F);	// @ (0x32B * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// I2C1BTO<TOBY32>
extern volatile __bit                   TOBY32              __at(0x14E6);	// @ (0x29C * 8 + 6)
#define                                 TOBY32_bit          _BIT_ACCESS(I2C1BTO,6)
// I2C1BTO<TOREC>
extern volatile __bit                   TOREC               __at(0x14E7);	// @ (0x29C * 8 + 7)
#define                                 TOREC_bit           _BIT_ACCESS(I2C1BTO,7)
// I2C1BTO<TOTIME0>
extern volatile __bit                   TOTIME0             __at(0x14E0);	// @ (0x29C * 8 + 0)
#define                                 TOTIME0_bit         _BIT_ACCESS(I2C1BTO,0)
// I2C1BTO<TOTIME1>
extern volatile __bit                   TOTIME1             __at(0x14E1);	// @ (0x29C * 8 + 1)
#define                                 TOTIME1_bit         _BIT_ACCESS(I2C1BTO,1)
// I2C1BTO<TOTIME2>
extern volatile __bit                   TOTIME2             __at(0x14E2);	// @ (0x29C * 8 + 2)
#define                                 TOTIME2_bit         _BIT_ACCESS(I2C1BTO,2)
// I2C1BTO<TOTIME3>
extern volatile __bit                   TOTIME3             __at(0x14E3);	// @ (0x29C * 8 + 3)
#define                                 TOTIME3_bit         _BIT_ACCESS(I2C1BTO,3)
// I2C1BTO<TOTIME4>
extern volatile __bit                   TOTIME4             __at(0x14E4);	// @ (0x29C * 8 + 4)
#define                                 TOTIME4_bit         _BIT_ACCESS(I2C1BTO,4)
// I2C1BTO<TOTIME5>
extern volatile __bit                   TOTIME5             __at(0x14E5);	// @ (0x29C * 8 + 5)
#define                                 TOTIME5_bit         _BIT_ACCESS(I2C1BTO,5)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1B06);	// @ (0x360 * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x2630);	// @ (0x4C6 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x2631);	// @ (0x4C6 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x2632);	// @ (0x4C6 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x2633);	// @ (0x4C6 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x2634);	// @ (0x4C6 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x2635);	// @ (0x4C6 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x2640);	// @ (0x4C8 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x2641);	// @ (0x4C8 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x2642);	// @ (0x4C8 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x2643);	// @ (0x4C8 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x2644);	// @ (0x4C8 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x2645);	// @ (0x4C8 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 TS_bit              _BIT_ACCESS(SMT1STAT,2)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x1B08);	// @ (0x361 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x1B09);	// @ (0x361 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x1B0A);	// @ (0x361 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x1B0B);	// @ (0x361 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1EBD);	// @ (0x3D7 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1EBC);	// @ (0x3D7 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x580);	// @ (0xB0 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x581);	// @ (0xB0 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x582);	// @ (0xB0 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x583);	// @ (0xB0 * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x584);	// @ (0xB0 * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x585);	// @ (0xB0 * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// I2C1CON1<TXU>
extern volatile __bit                   TXU                 __at(0x14A9);	// @ (0x295 * 8 + 1)
#define                                 TXU_bit             _BIT_ACCESS(I2C1CON1,1)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x155E);	// @ (0x2AB * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x158A);	// @ (0x2B1 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0x158E);	// @ (0x2B1 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x159D);	// @ (0x2B3 * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x1595);	// @ (0x2B2 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x155F);	// @ (0x2AB * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1561);	// @ (0x2AC * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x156B);	// @ (0x2AD * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x159C);	// @ (0x2B3 * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x1594);	// @ (0x2B2 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// U1CTSPPS<U1CTSPPS0>
extern volatile __bit                   U1CTSPPS0           __at(0x1398);	// @ (0x273 * 8 + 0)
#define                                 U1CTSPPS0_bit       _BIT_ACCESS(U1CTSPPS,0)
// U1CTSPPS<U1CTSPPS1>
extern volatile __bit                   U1CTSPPS1           __at(0x1399);	// @ (0x273 * 8 + 1)
#define                                 U1CTSPPS1_bit       _BIT_ACCESS(U1CTSPPS,1)
// U1CTSPPS<U1CTSPPS2>
extern volatile __bit                   U1CTSPPS2           __at(0x139A);	// @ (0x273 * 8 + 2)
#define                                 U1CTSPPS2_bit       _BIT_ACCESS(U1CTSPPS,2)
// U1CTSPPS<U1CTSPPS3>
extern volatile __bit                   U1CTSPPS3           __at(0x139B);	// @ (0x273 * 8 + 3)
#define                                 U1CTSPPS3_bit       _BIT_ACCESS(U1CTSPPS,3)
// U1CTSPPS<U1CTSPPS4>
extern volatile __bit                   U1CTSPPS4           __at(0x139C);	// @ (0x273 * 8 + 4)
#define                                 U1CTSPPS4_bit       _BIT_ACCESS(U1CTSPPS,4)
// U1CTSPPS<U1CTSPPS5>
extern volatile __bit                   U1CTSPPS5           __at(0x139D);	// @ (0x273 * 8 + 5)
#define                                 U1CTSPPS5_bit       _BIT_ACCESS(U1CTSPPS,5)
// PIE4<U1EIE>
extern volatile __bit                   U1EIE               __at(0x2562);	// @ (0x4AC * 8 + 2)
#define                                 U1EIE_bit           _BIT_ACCESS(PIE4,2)
// PIR4<U1EIF>
extern volatile __bit                   U1EIF               __at(0x25BA);	// @ (0x4B7 * 8 + 2)
#define                                 U1EIF_bit           _BIT_ACCESS(PIR4,2)
// IPR4<U1EIP>
extern volatile __bit                   U1EIP               __at(0x1B5A);	// @ (0x36B * 8 + 2)
#define                                 U1EIP_bit           _BIT_ACCESS(IPR4,2)
// U1ERRIE<U1FERIE>
extern volatile __bit                   U1FERIE             __at(0x159B);	// @ (0x2B3 * 8 + 3)
#define                                 U1FERIE_bit         _BIT_ACCESS(U1ERRIE,3)
// U1ERRIR<U1FERIF>
extern volatile __bit                   U1FERIF             __at(0x1593);	// @ (0x2B2 * 8 + 3)
#define                                 U1FERIF_bit         _BIT_ACCESS(U1ERRIR,3)
// U1CON2<U1FLO0>
extern volatile __bit                   U1FLO0              __at(0x1568);	// @ (0x2AD * 8 + 0)
#define                                 U1FLO0_bit          _BIT_ACCESS(U1CON2,0)
// U1CON2<U1FLO1>
extern volatile __bit                   U1FLO1              __at(0x1569);	// @ (0x2AD * 8 + 1)
#define                                 U1FLO1_bit          _BIT_ACCESS(U1CON2,1)
// PIE4<U1IE>
extern volatile __bit                   U1IE                __at(0x2563);	// @ (0x4AC * 8 + 3)
#define                                 U1IE_bit            _BIT_ACCESS(PIE4,3)
// PIR4<U1IF>
extern volatile __bit                   U1IF                __at(0x25BB);	// @ (0x4B7 * 8 + 3)
#define                                 U1IF_bit            _BIT_ACCESS(PIR4,3)
// IPR4<U1IP>
extern volatile __bit                   U1IP                __at(0x1B5B);	// @ (0x36B * 8 + 3)
#define                                 U1IP_bit            _BIT_ACCESS(IPR4,3)
// PMD3<U1MD>
extern volatile __bit                   U1MD                __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 U1MD_bit            _BIT_ACCESS(PMD3,6)
// U1CON0<U1MODE0>
extern volatile __bit                   U1MODE0             __at(0x1558);	// @ (0x2AB * 8 + 0)
#define                                 U1MODE0_bit         _BIT_ACCESS(U1CON0,0)
// U1CON0<U1MODE1>
extern volatile __bit                   U1MODE1             __at(0x1559);	// @ (0x2AB * 8 + 1)
#define                                 U1MODE1_bit         _BIT_ACCESS(U1CON0,1)
// U1CON0<U1MODE2>
extern volatile __bit                   U1MODE2             __at(0x155A);	// @ (0x2AB * 8 + 2)
#define                                 U1MODE2_bit         _BIT_ACCESS(U1CON0,2)
// U1CON0<U1MODE3>
extern volatile __bit                   U1MODE3             __at(0x155B);	// @ (0x2AB * 8 + 3)
#define                                 U1MODE3_bit         _BIT_ACCESS(U1CON0,3)
// U1CON1<U1ON>
extern volatile __bit                   U1ON                __at(0x1567);	// @ (0x2AC * 8 + 7)
#define                                 U1ON_bit            _BIT_ACCESS(U1CON1,7)
// U1ERRIE<U1PERIE>
extern volatile __bit                   U1PERIE             __at(0x159E);	// @ (0x2B3 * 8 + 6)
#define                                 U1PERIE_bit         _BIT_ACCESS(U1ERRIE,6)
// U1ERRIR<U1PERIF>
extern volatile __bit                   U1PERIF             __at(0x1596);	// @ (0x2B2 * 8 + 6)
#define                                 U1PERIF_bit         _BIT_ACCESS(U1ERRIR,6)
// U1FIFO<U1RCIDL>
extern volatile __bit                   U1RCIDL             __at(0x1583);	// @ (0x2B0 * 8 + 3)
#define                                 U1RCIDL_bit         _BIT_ACCESS(U1FIFO,3)
// U1CON2<U1RUNOVF>
extern volatile __bit                   U1RUNOVF            __at(0x156F);	// @ (0x2AD * 8 + 7)
#define                                 U1RUNOVF_bit        _BIT_ACCESS(U1CON2,7)
// U1FIFO<U1RXBE>
extern volatile __bit                   U1RXBE              __at(0x1581);	// @ (0x2B0 * 8 + 1)
#define                                 U1RXBE_bit          _BIT_ACCESS(U1FIFO,1)
// U1FIFO<U1RXBF>
extern volatile __bit                   U1RXBF              __at(0x1580);	// @ (0x2B0 * 8 + 0)
#define                                 U1RXBF_bit          _BIT_ACCESS(U1FIFO,0)
// U1CON1<U1RXBIMD>
extern volatile __bit                   U1RXBIMD            __at(0x1563);	// @ (0x2AC * 8 + 3)
#define                                 U1RXBIMD_bit        _BIT_ACCESS(U1CON1,3)
// U1ERRIE<U1RXBKIE>
extern volatile __bit                   U1RXBKIE            __at(0x159A);	// @ (0x2B3 * 8 + 2)
#define                                 U1RXBKIE_bit        _BIT_ACCESS(U1ERRIE,2)
// U1ERRIR<U1RXBKIF>
extern volatile __bit                   U1RXBKIF            __at(0x1592);	// @ (0x2B2 * 8 + 2)
#define                                 U1RXBKIF_bit        _BIT_ACCESS(U1ERRIR,2)
// U1CON0<U1RXEN>
extern volatile __bit                   U1RXEN              __at(0x155C);	// @ (0x2AB * 8 + 4)
#define                                 U1RXEN_bit          _BIT_ACCESS(U1CON0,4)
// U1ERRIE<U1RXFOIE>
extern volatile __bit                   U1RXFOIE            __at(0x1599);	// @ (0x2B3 * 8 + 1)
#define                                 U1RXFOIE_bit        _BIT_ACCESS(U1ERRIE,1)
// U1ERRIR<U1RXFOIF>
extern volatile __bit                   U1RXFOIF            __at(0x1591);	// @ (0x2B2 * 8 + 1)
#define                                 U1RXFOIF_bit        _BIT_ACCESS(U1ERRIR,1)
// U1FIFO<U1RXIDL>
extern volatile __bit                   U1RXIDL             __at(0x1583);	// @ (0x2B0 * 8 + 3)
#define                                 U1RXIDL_bit         _BIT_ACCESS(U1FIFO,3)
// PIE4<U1RXIE>
extern volatile __bit                   U1RXIE              __at(0x2560);	// @ (0x4AC * 8 + 0)
#define                                 U1RXIE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<U1RXIF>
extern volatile __bit                   U1RXIF              __at(0x25B8);	// @ (0x4B7 * 8 + 0)
#define                                 U1RXIF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<U1RXIP>
extern volatile __bit                   U1RXIP              __at(0x1B58);	// @ (0x36B * 8 + 0)
#define                                 U1RXIP_bit          _BIT_ACCESS(IPR4,0)
// U1CON2<U1RXPOL>
extern volatile __bit                   U1RXPOL             __at(0x156E);	// @ (0x2AD * 8 + 6)
#define                                 U1RXPOL_bit         _BIT_ACCESS(U1CON2,6)
// U1RXPPS<U1RXPPS0>
extern volatile __bit                   U1RXPPS0            __at(0x1390);	// @ (0x272 * 8 + 0)
#define                                 U1RXPPS0_bit        _BIT_ACCESS(U1RXPPS,0)
// U1RXPPS<U1RXPPS1>
extern volatile __bit                   U1RXPPS1            __at(0x1391);	// @ (0x272 * 8 + 1)
#define                                 U1RXPPS1_bit        _BIT_ACCESS(U1RXPPS,1)
// U1RXPPS<U1RXPPS2>
extern volatile __bit                   U1RXPPS2            __at(0x1392);	// @ (0x272 * 8 + 2)
#define                                 U1RXPPS2_bit        _BIT_ACCESS(U1RXPPS,2)
// U1RXPPS<U1RXPPS3>
extern volatile __bit                   U1RXPPS3            __at(0x1393);	// @ (0x272 * 8 + 3)
#define                                 U1RXPPS3_bit        _BIT_ACCESS(U1RXPPS,3)
// U1RXPPS<U1RXPPS4>
extern volatile __bit                   U1RXPPS4            __at(0x1394);	// @ (0x272 * 8 + 4)
#define                                 U1RXPPS4_bit        _BIT_ACCESS(U1RXPPS,4)
// U1RXPPS<U1RXPPS5>
extern volatile __bit                   U1RXPPS5            __at(0x1395);	// @ (0x272 * 8 + 5)
#define                                 U1RXPPS5_bit        _BIT_ACCESS(U1RXPPS,5)
// U1CON1<U1SENDB>
extern volatile __bit                   U1SENDB             __at(0x1560);	// @ (0x2AC * 8 + 0)
#define                                 U1SENDB_bit         _BIT_ACCESS(U1CON1,0)
// U1CON2<U1STP0>
extern volatile __bit                   U1STP0              __at(0x156C);	// @ (0x2AD * 8 + 4)
#define                                 U1STP0_bit          _BIT_ACCESS(U1CON2,4)
// U1CON2<U1STP1>
extern volatile __bit                   U1STP1              __at(0x156D);	// @ (0x2AD * 8 + 5)
#define                                 U1STP1_bit          _BIT_ACCESS(U1CON2,5)
// U1FIFO<U1STPMD>
extern volatile __bit                   U1STPMD             __at(0x1586);	// @ (0x2B0 * 8 + 6)
#define                                 U1STPMD_bit         _BIT_ACCESS(U1FIFO,6)
// U1FIFO<U1TXBE>
extern volatile __bit                   U1TXBE              __at(0x1585);	// @ (0x2B0 * 8 + 5)
#define                                 U1TXBE_bit          _BIT_ACCESS(U1FIFO,5)
// U1FIFO<U1TXBF>
extern volatile __bit                   U1TXBF              __at(0x1584);	// @ (0x2B0 * 8 + 4)
#define                                 U1TXBF_bit          _BIT_ACCESS(U1FIFO,4)
// U1ERRIE<U1TXCIE>
extern volatile __bit                   U1TXCIE             __at(0x1598);	// @ (0x2B3 * 8 + 0)
#define                                 U1TXCIE_bit         _BIT_ACCESS(U1ERRIE,0)
// U1ERRIR<U1TXCIF>
extern volatile __bit                   U1TXCIF             __at(0x1590);	// @ (0x2B2 * 8 + 0)
#define                                 U1TXCIF_bit         _BIT_ACCESS(U1ERRIR,0)
// U1CON0<U1TXEN>
extern volatile __bit                   U1TXEN              __at(0x155D);	// @ (0x2AB * 8 + 5)
#define                                 U1TXEN_bit          _BIT_ACCESS(U1CON0,5)
// PIE4<U1TXIE>
extern volatile __bit                   U1TXIE              __at(0x2561);	// @ (0x4AC * 8 + 1)
#define                                 U1TXIE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<U1TXIF>
extern volatile __bit                   U1TXIF              __at(0x25B9);	// @ (0x4B7 * 8 + 1)
